emacs/scheme/README.org
* Scheme

** How to run Scheme code in Emacs?

Type =M-x run-scheme= command.

** How to solve "Searching for program: No such file or directory, scheme"?

  - M-x customize-variable
  - Enter 'scheme-program-name'. Press Enter.
  - Replace 'scheme' with the path to your Scheme executable.
  - Click the 'State' button and select 'Save for Future Sessions'.
  
