emacs/scheme/README.md

# Table of Contents

1.  [Scheme](#org1312675)
    1.  [How to run Scheme code in Emacs?](#org5845f56)
    2.  [How to solve "Searching for program: No such file or directory, scheme"?](#org0cfae44)


<a id="org1312675"></a>

# Scheme


<a id="org5845f56"></a>

## How to run Scheme code in Emacs?

Type `M-x run-scheme` command.


<a id="org0cfae44"></a>

## How to solve "Searching for program: No such file or directory, scheme"?

-   M-x customize-variable
-   Enter 'scheme-program-name'. Press Enter.
-   Replace 'scheme' with the path to your Scheme executable.
-   Click the 'State' button and select 'Save for Future Sessions'.

